OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
//---------------------------------------------------------------------
// Build status data
// --------------------------------------------------------------------

void buildStatus(JsonDocument &doc) {

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  if (net.isWiredConnected()) {
    doc["mode"] = "Wired";
  } else if (net.isWifiModeStaOnly()) {
    doc["mode"] = "STA";
  } else if (net.isWifiModeApOnly()) {
    doc["mode"] = "AP";
  } else if (net.isWifiModeAp() && net.isWifiModeSta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["macaddress"] = net.getMac();

  doc["emoncms_connected"] = (int)emoncms_connected;
  doc["packets_sent"] = packets_sent;
  doc["packets_success"] = packets_success;

  doc["mqtt_connected"] = (int)mqtt.isConnected();

  doc["ocpp_connected"] = (int)OcppTask::isConnected();

#if defined(ENABLE_PN532) || defined(ENABLE_RFID)
  doc["rfid_failure"] = (int) rfid.communicationFails();
#endif

  doc["ohm_hour"] = ohm_hour;

  doc["free_heap"] = ESPAL.getFreeHeap();

  doc["comm_sent"] = rapiSender.getSent();
  doc["comm_success"] = rapiSender.getSuccess();
  doc["rapi_connected"] = (int)rapiSender.isConnected();
  doc["evse_connected"] = (int)evse.isConnected();

  create_rapi_json(doc);

  doc["gfcicount"] = evse.getFaultCountGFCI();
  doc["nogndcount"] = evse.getFaultCountNoGround();
  doc["stuckcount"] = evse.getFaultCountStuckRelay();

  doc["solar"] = solar;
  doc["grid_ie"] = grid_ie;
  doc["charge_rate"] = divert.getChargeRate();
  doc["divert_update"] = (millis() - divert.getLastUpdate()) / 1000;
  doc["divert_active"] = divert.isActive();
  doc["shaper"] = shaper.getState()?1:0;
  doc["shaper_live_pwr"] = shaper.getLivePwr();
  // doc["shaper_cur"] = shaper.getChgCur();
  doc["shaper_cur"] = shaper.getMaxCur();
  doc["shaper_updated"] = shaper.isUpdated();
  doc["service_level"] = static_cast<uint8_t>(evse.getActualServiceLevel());
  doc["limit"] = limit.hasLimit();

  doc["ota_update"] = (int)Update.isRunning();

  doc["config_version"] = config_version();
  doc["claims_version"] = evse.getClaimsVersion();
  doc["override_version"] = manual.getVersion();
  doc["schedule_version"] = scheduler.getVersion();
  doc["schedule_plan_version"] = scheduler.getPlanVersion();
  doc["limit_version"] = limit.getVersion();

  doc["vehicle_state_update"] = (millis() - evse.getVehicleLastUpdated()) / 1000;
  if(teslaClient.getVehicleCnt() > 0) {
    doc["tesla_vehicle_count"] = teslaClient.getVehicleCnt();
    doc["tesla_vehicle_id"] = teslaClient.getVehicleId(teslaClient.getCurVehicleIdx());
    doc["tesla_vehicle_name"] = teslaClient.getVehicleDisplayName(teslaClient.getCurVehicleIdx());
    teslaClient.getChargeInfoJson(doc);
  } else {
    doc["tesla_vehicle_count"] = false;
    doc["tesla_vehicle_id"] = false;
    doc["tesla_vehicle_name"] = false;
    if(evse.isVehicleStateOfChargeValid()) {
      doc["battery_level"] = evse.getVehicleStateOfCharge();
    }
    if(evse.isVehicleRangeValid()) {
      doc["battery_range"] = evse.getVehicleRange();
    }
    if(evse.isVehicleEtaValid()) {
      doc["time_to_full_charge"] = evse.getVehicleEta();
    }
  }

  DBUGF("/status ArduinoJson size: %dbytes", doc.size());
}

// -------------------------------------------------------------------
// Wifi scan /scan not currently used
// url: /scan
//
// First request will return 0 results unless you start scan from somewhere else (loop/setup)
// Do not request more often than 3-5 seconds
// -------------------------------------------------------------------
void
handleScan(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

  DBUGF("Starting WiFi scan");
  net.wifiScanNetworks([request, response](int networksFound) {
    DBUGF("%d networks found", networksFound);
    String json = "[";
    for (int i = 0; i < networksFound; ++i) {
      if(i) json += ",";
      json += "{";
      json += "\"rssi\":"+String(WiFi.RSSI(i));
      json += ",\"ssid\":\""+WiFi.SSID(i)+"\"";
      json += ",\"bssid\":\""+WiFi.BSSIDstr(i)+"\"";
      json += ",\"channel\":"+String(WiFi.channel(i));
      json += ",\"secure\":"+String(WiFi.encryptionType(i));
      json += "}";
    }
    json += "]";
    response->print(json);
    request->send(response);
  });
}

// -------------------------------------------------------------------
// Handle turning Access point off
// url: /apoff
// -------------------------------------------------------------------
void
handleAPOff(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  response->setCode(200);
  response->print("Turning AP Off");
  request->send(response);

  DBUGLN("Turning AP Off");
  apOffTime = millis() + 1000;
}

// -------------------------------------------------------------------
// Change divert mode (solar PV divert mode) e.g 1:Normal (default), 2:Eco
// url: /divertmode
// -------------------------------------------------------------------
void
handleDivertMode(MongooseHttpServerRequest *request){
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  DivertMode divertmode = (DivertMode)(request->getParam("divertmode").toInt());
  divert.setMode(divertmode);

  response->setCode(200);
  response->print("Divert Mode changed");
  request->send(response);

  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  shaper.setState(request->getParam("shaper").toInt() == 1? true: false);

  response->setCode(200);
  response->print("Current Shaper state changed");
  request->send(response);

  DBUGF("CurrentShaper: %d", shaper.getState());
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void handleSetTime(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  handleTimePost(request, response);

  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  JsonDocument doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc["vehicles"].to<JsonArray>();

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.add<JsonObject>();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void handleStatusPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  // Deserialize the JSON document
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, body);
  if(!error)
  {
    bool send_event = true;

    if(doc["voltage"].is<double>())
    {
      double volts = doc["voltage"];
      DBUGF("voltage:%.1f", volts);
      evse.setVoltage(volts);
    }
    if(doc["shaper_live_pwr"].is<double>())
    {
      double shaper_live_pwr = doc["shaper_live_pwr"];
      shaper.setLivePwr(shaper_live_pwr);
      DBUGF("shaper: live power:%dW", shaper.getLivePwr());
    }
    if(doc["solar"].is<int>()) {
      solar = doc["solar"];
      DBUGF("solar:%dW", solar);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    else if(doc["grid_ie"].is<int>()) {
      grid_ie = doc["grid_ie"];
      DBUGF("grid:%dW", grid_ie);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    if(doc["battery_level"].is<double>() && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_soc = doc["battery_level"];
      DBUGF("vehicle_soc:%d%%", vehicle_soc);
      evse.setVehicleStateOfCharge(vehicle_soc);
      doc["vehicle_state_update"] = 0;
    }
    if(doc["battery_range"].is<double>() && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_range = doc["battery_range"];
      DBUGF("vehicle_range:%dKM", vehicle_range);
      evse.setVehicleRange(vehicle_range);
      doc["vehicle_state_update"] = 0;
    }
    if(doc["time_to_full_charge"].is<double>() && vehicle_data_src == VEHICLE_DATA_SRC_HTTP){
      double vehicle_eta = doc["time_to_full_charge"];
      DBUGF("vehicle_eta:%d", vehicle_eta);
      evse.setVehicleEta(vehicle_eta);
      doc["vehicle_state_update"] = 0;
    }
    // send back new value to clients
    if(send_event) {
      event_send(doc);
    }
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}


void
handleStatus(MongooseHttpServerRequest *request)
{

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

