OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  String url = F("https://");
  url += request->host().toString();
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

void onWsFrame(MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len)
{
  DBUGF("Got message %.*s", len, (const char *)data);
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, data, len);
  if (!error) {
    if (doc["ping"].is<int8_t>())
      {
        // answer pong
        connection->send("{\"pong\": 1}");

      }
  }
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  DBUGF("New client connected over ws");
  // pushing states to client
  JsonDocument doc;
  buildStatus(doc);
  web_server_event(doc);
}

/*
 * Really simple 'conversion' of ASCII to UTF-8, basically only a few places send >127 chars
 * so just filter those to be acceptable as UTF-8
 */
void web_server_send_ascii_utf8(const char *endpoint, const uint8_t *buffer, size_t size)
{
  char temp[size];
  for(int i = 0; i < size; i++) {
    temp[i] = buffer[i] & 0x7f;
  }
  server.sendAll(endpoint, WEBSOCKET_OP_TEXT, temp, size);
}

void web_server_setup()
{
  bool use_ssl = false;
  if(www_certificate_id != "")
  {
    uint64_t cert_id = std::stoull(www_certificate_id.c_str(), nullptr, 16);
    const char *cert = certs.getCertificate(cert_id);
    const char *key = certs.getKey(cert_id);
    if(NULL != cert && NULL != key)
    {
      server.begin(443, cert, key);
      use_ssl = true;

      redirect.begin(80);
      redirect.on("/", handleHttpsRedirect);
    }
  }

  if(false == use_ssl) {
    server.begin(80);
  }

  // Handle status updates
  server.on("/status$", handleStatus);
  server.on("/config$", handleConfig);

  // Handle HTTP web interface button presses
  server.on("/teslaveh$", handleTeslaVeh);
  server.on("/tesla/vehicles$", handleTeslaVeh);
  server.on("/settime$", handleSetTime);
  server.on("/reset$", handleRst);
  server.on("/restart$", handleRestart);
  server.on("/rapi$", handleRapi);
  server.on("/r$", handleRapi);
  server.on("/scan$", handleScan);
  server.on("/apoff$", handleAPOff);
  server.on("/divertmode$", handleDivertMode);
  server.on("/shaper$", handleCurrentShaper);
  server.on("/emoncms/describe$", handleDescribe);
  server.on("/rfid/add$", handleAddRFID);

  server.on("/schedule/plan$", handleSchedulePlan);
  server.on("/schedule", handleSchedule);

  server.on("/claims/target$", handleEvseClaimsTarget);
  server.on("/claims", handleEvseClaims);

  server.on("/override$", handleOverride);

  server.on("/logs", handleEventLogs);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);

  // Simple Firmware Update Form
  server.on("/update$")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  server.on("/debug$", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialDebug.printBuffer(*response);
    request->send(response);
  });

  server.on("/debug/console$")->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    server.sendAll("/debug/console", WEBSOCKET_OP_TEXT, buffer, size);
  });

  server.on("/evse$", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console$")->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  server.on("/ws$")->
    onFrame(onWsFrame)
    ->
    onConnect(onWsConnect);

  server.onNotFound(handleNotFound);

  DEBUG.println("Server started");
}

void
web_server_loop() {
  Profile_Start(web_server_loop);

  // Do we need to restart the WiFi?
  if(wifiRestartTime > 0 && millis() > wifiRestartTime) {
    wifiRestartTime = 0;
    net.wifiRestart();
  }

  // Do we need to turn off the access point?
  if(apOffTime > 0 && millis() > apOffTime) {
    apOffTime = 0;
    net.wifiTurnOffAp();
  }

  Profile_End(web_server_loop, 5);
}

void web_server_event(JsonDocument &event)
{
  String json;
  serializeJson(event, json);
  server.sendAll("/ws", json);
}
